In [2]:
import numpy as np

from scipy.stats import norm

hii

sample size hamesha greater than 30 hona chahiye but yaha aisi exmaple ke liye use kiye hai

In [5]:
sample = [172, 174 , 168 , 169 , 171, 173, 175 , 170 , 169 , 172]

population_mean = 170 
population_std = 3 
samp_mean = np.mean(sample)

n = len(sample)

In [6]:
z_score = (samp_mean - population_mean) / (population_std / np.sqrt(n))

In [9]:
print(z_score)

1.3703203194063098

In [11]:
p_value = 2 * (1- norm.cdf(abs(z_score)))

In [13]:
p_value

np.float64(0.17058693287143756)

ab isko alpha se compare krenge

In [14]:
alpha = 0.05

In [16]:
if p_value < alpha:
    print(" i will reject the numm")
else:
    print("i will accept the hypothesis")

i will accept the hypothesis

T - Test

In [1]:
import numpy as np 
from scipy import stats

In [2]:
sample = [ 172 , 174, 168,169, 171 , 173 , 175 , 170 ,169, 172 ]
sample_mean = np.mean(sample)

sample_std= np.std(sample, ddof=1)

In [4]:
n=len(sample)
mean_population=170

In [7]:
# p value ka use krne se pehle t test nikalte 

t_stats = ( sample_mean - mean_population) / (sample_std / np.sqrt(n))

t_stats

np.float64(1.7782469350914734)

In [8]:
p_value = 2*(1- stats.t.cdf(abs(t_stats), df= n-1))

alpha = 0.05
p_value

np.float64(0.10907771593031335)

In [9]:
if p_value < alpha  : 
    print("reject the null hypothesis ")

else: 
    print("accept the null hypothesis")

accept the null hypothesis

two sample  T test

In [10]:
import numpy as np 
from scipy import stats

In [11]:
group_A = [85 , 88 , 90, 92 , 87 , 85 , 89 , 91 , 86 , 88]

group_B = [ 82, 84 , 80 , 83 , 81, 79 , 78 , 85 , 84 , 83]

 null hypothesis mean dono grp ek jaisa kaam kr rha 

 agr value  CI  se  bahar jaayega  to difference hai performance me 

 humne T -Test se nikalte dekha   ab hum p value se nikalenge

In [13]:
t_stats , p_value = stats.ttest_ind(group_A , group_B , equal_var=False)

In [14]:
t_stats

np.float64(5.829604009507161)

upper T value ke thtough bta diya  ab hum p value ke though btayenge jaha hum alpha value ko use krke btayenge

In [17]:
p_value

np.float64(1.610475598965881e-05)

In [18]:
alpha = 0.05

In [ ]:
if p_value < alpha : 
    print("i will reject the null hypothesis")
else: 
    print(" i will accept the null hypothese ")

Chi square value

In [19]:
import numpy as np 
import seaborn as sns 
from scipy.stats import chi2_contingency
import pandas as pd

In [25]:
df= sns.load_dataset('titanic')

In [26]:
contingency_table = pd.crosstab(df['sex'], df['survived'])

In [28]:
contingency_table

survived    0    1
sex
female     81  233
male      468  109

In [ ]:
chi2 , p_value , dof , expected = chi2_contingency(contingency_table)

In [32]:
expected

array([[193.47474747, 120.52525253],
       [355.52525253, 221.47474747]])

In [33]:
dof

1

In [34]:
chi2

np.float64(260.71702016732104)

In [35]:
alpha = 0.05

In [36]:
if p_value < alpha:
    print(" we reject the null hypothesis and there is a significant relationship between ")
else : 
    print("there is no connection ")

 we reject the null hypothesis and there is a significant relationship between

ANNOVA TEST

In [37]:
import seaborn as sns 

import pandas as pd 

from scipy.stats import f_oneway

In [38]:
df = sns.load_dataset('titanic')
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [43]:
df= df[['age', 'pclass']].dropna()

In [44]:
df['pclass'].unique()

array([3, 1, 2])

In [47]:
class_1 = df[ df['pclass'] ==1  ]['age']
class_2 = df[ df['pclass'] ==2  ]['age']

class_3 = df[ df['pclass'] ==3  ]['age']

class_1

1      38.0
3      35.0
6      54.0
11     58.0
23     28.0
       ...
871    47.0
872    33.0
879    56.0
887    19.0
889    26.0
Name: age, Length: 186, dtype: float64

ab hame conenction dekhna hai

In [62]:
# anova test

f_stats , p_value = f_oneway(class_1 , class_2 , class_3 )

In [63]:
f_stats

np.float64(57.443484340676214)

jaisa waha hamne critical test se kiya tha waisi yaha bhi annova test kr skte 

but yaha p value se kr rhe

In [64]:
p_value

np.float64(7.487984171959904e-24)

In [65]:
alpha = 0.05

In [ ]:
if p_value < alpha : 
    print("reject the null hypothesisi and there is a significant difference in  atleast one passeneger class ")
    
else : 
    print("there is no significant diference ")